---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RunBottomHigherThanTopFailure
source: html/9c4b1ca6-1c93-d57a-390c-818b781170dd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RunBottomHigherThanTopFailure Property

The base elevation for the run is higher than the top elevation for the run.

## Syntax (C#)
```csharp
public static FailureDefinitionId RunBottomHigherThanTopFailure { get; }
```